grevaillot/svd_tools/headers/STM32H7B3x/hrtim_time.h
#define HRTIM_TIME_CHPER_STRTPW_SHIFT		7
#define HRTIM_TIME_CHPER_STRTPW_MASK		0x0f
/** @defgroup hrtim_time_chper_strtpw STRTPW STRTPW
@{*/
/**@}*/


#define HRTIM_TIME_CHPER_CHPDTY_SHIFT		4
#define HRTIM_TIME_CHPER_CHPDTY_MASK		0x07
/** @defgroup hrtim_time_chper_chpdty CHPDTY Timerx chopper duty cycle value
@{*/
/**@}*/


#define HRTIM_TIME_CHPER_CHPFRQ_SHIFT		0
#define HRTIM_TIME_CHPER_CHPFRQ_MASK		0x0f
/** @defgroup hrtim_time_chper_chpfrq CHPFRQ Timerx carrier frequency value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_cpt1ecr CPT1ECR Timerx Capture 2 Control Register
@{*/

/** HRTIM_TIME_CPT1ECR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIME_CPT1ECR_TDCMP2		(1 << 27)
/** HRTIM_TIME_CPT1ECR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIME_CPT1ECR_TDCMP1		(1 << 26)
/** HRTIM_TIME_CPT1ECR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIME_CPT1ECR_TD1RST		(1 << 25)
/** HRTIM_TIME_CPT1ECR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIME_CPT1ECR_TD1SET		(1 << 24)
/** HRTIM_TIME_CPT1ECR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIME_CPT1ECR_TCCMP2		(1 << 23)
/** HRTIM_TIME_CPT1ECR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIME_CPT1ECR_TCCMP1		(1 << 22)
/** HRTIM_TIME_CPT1ECR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIME_CPT1ECR_TC1RST		(1 << 21)
/** HRTIM_TIME_CPT1ECR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIME_CPT1ECR_TC1SET		(1 << 20)
/** HRTIM_TIME_CPT1ECR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIME_CPT1ECR_TBCMP2		(1 << 19)
/** HRTIM_TIME_CPT1ECR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIME_CPT1ECR_TBCMP1		(1 << 18)
/** HRTIM_TIME_CPT1ECR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIME_CPT1ECR_TB1RST		(1 << 17)
/** HRTIM_TIME_CPT1ECR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIME_CPT1ECR_TB1SET		(1 << 16)
/** HRTIM_TIME_CPT1ECR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIME_CPT1ECR_TACMP2		(1 << 15)
/** HRTIM_TIME_CPT1ECR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIME_CPT1ECR_TACMP1		(1 << 14)
/** HRTIM_TIME_CPT1ECR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIME_CPT1ECR_TA1RST		(1 << 13)
/** HRTIM_TIME_CPT1ECR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIME_CPT1ECR_TA1SET		(1 << 12)
/** HRTIM_TIME_CPT1ECR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV10CPT		(1 << 11)
/** HRTIM_TIME_CPT1ECR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV9CPT		(1 << 10)
/** HRTIM_TIME_CPT1ECR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV8CPT		(1 << 9)
/** HRTIM_TIME_CPT1ECR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV7CPT		(1 << 8)
/** HRTIM_TIME_CPT1ECR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV6CPT		(1 << 7)
/** HRTIM_TIME_CPT1ECR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV5CPT		(1 << 6)
/** HRTIM_TIME_CPT1ECR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV4CPT		(1 << 5)
/** HRTIM_TIME_CPT1ECR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV3CPT		(1 << 4)
/** HRTIM_TIME_CPT1ECR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV2CPT		(1 << 3)
/** HRTIM_TIME_CPT1ECR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIME_CPT1ECR_EXEV1CPT		(1 << 2)
/** HRTIM_TIME_CPT1ECR_UDPCPT Update Capture **/
#define HRTIM_TIME_CPT1ECR_UDPCPT		(1 << 1)
/** HRTIM_TIME_CPT1ECR_SWCPT Software Capture **/
#define HRTIM_TIME_CPT1ECR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_cpt2ecr CPT2ECR CPT2xCR
@{*/

/** HRTIM_TIME_CPT2ECR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIME_CPT2ECR_TDCMP2		(1 << 27)
/** HRTIM_TIME_CPT2ECR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIME_CPT2ECR_TDCMP1		(1 << 26)
/** HRTIM_TIME_CPT2ECR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIME_CPT2ECR_TD1RST		(1 << 25)
/** HRTIM_TIME_CPT2ECR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIME_CPT2ECR_TD1SET		(1 << 24)
/** HRTIM_TIME_CPT2ECR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIME_CPT2ECR_TCCMP2		(1 << 23)
/** HRTIM_TIME_CPT2ECR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIME_CPT2ECR_TCCMP1		(1 << 22)
/** HRTIM_TIME_CPT2ECR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIME_CPT2ECR_TC1RST		(1 << 21)
/** HRTIM_TIME_CPT2ECR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIME_CPT2ECR_TC1SET		(1 << 20)
/** HRTIM_TIME_CPT2ECR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIME_CPT2ECR_TBCMP2		(1 << 19)
/** HRTIM_TIME_CPT2ECR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIME_CPT2ECR_TBCMP1		(1 << 18)
/** HRTIM_TIME_CPT2ECR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIME_CPT2ECR_TB1RST		(1 << 17)
/** HRTIM_TIME_CPT2ECR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIME_CPT2ECR_TB1SET		(1 << 16)
/** HRTIM_TIME_CPT2ECR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIME_CPT2ECR_TACMP2		(1 << 15)
/** HRTIM_TIME_CPT2ECR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIME_CPT2ECR_TACMP1		(1 << 14)
/** HRTIM_TIME_CPT2ECR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIME_CPT2ECR_TA1RST		(1 << 13)
/** HRTIM_TIME_CPT2ECR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIME_CPT2ECR_TA1SET		(1 << 12)
/** HRTIM_TIME_CPT2ECR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV10CPT		(1 << 11)
/** HRTIM_TIME_CPT2ECR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV9CPT		(1 << 10)
/** HRTIM_TIME_CPT2ECR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV8CPT		(1 << 9)
/** HRTIM_TIME_CPT2ECR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV7CPT		(1 << 8)
/** HRTIM_TIME_CPT2ECR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV6CPT		(1 << 7)
/** HRTIM_TIME_CPT2ECR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV5CPT		(1 << 6)
/** HRTIM_TIME_CPT2ECR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV4CPT		(1 << 5)
/** HRTIM_TIME_CPT2ECR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV3CPT		(1 << 4)
/** HRTIM_TIME_CPT2ECR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV2CPT		(1 << 3)
/** HRTIM_TIME_CPT2ECR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIME_CPT2ECR_EXEV1CPT		(1 << 2)
/** HRTIM_TIME_CPT2ECR_UDPCPT Update Capture **/
#define HRTIM_TIME_CPT2ECR_UDPCPT		(1 << 1)
/** HRTIM_TIME_CPT2ECR_SWCPT Software Capture **/
#define HRTIM_TIME_CPT2ECR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_outer OUTER Timerx Output Register
@{*/

/** HRTIM_TIME_OUTER_DIDL2 Output 2 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIME_OUTER_DIDL2		(1 << 23)
/** HRTIM_TIME_OUTER_CHP2 Output 2 Chopper enable **/
#define HRTIM_TIME_OUTER_CHP2		(1 << 22)

